Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON LATAM_Reunion.tmx
Source language: en
Languages: es_419

source: yeah, but if jae and pascoal finish their game early, they’ll join us too!
es_419: sí, pero jae y pascoal vendrán si terminan su juego temprano.

source: i’ll just wait for you outside...
es_419: te esperaré afuera…

source: hey, wait! come back!
es_419: ¡oye, espera! ¡regresa!

source: yeah, yeah, that’s you.
es_419: sí, sí, no hay duda.

source: come back!
es_419: ¡vuelve aquí!

source: i’ll take it from here.
es_419: yo me ocuparé de esto.

source: right. okay.
es_419: sí, claro.

source: phew. thanks for the reminder! let me grab my jacket real quick.
es_419: uf, ¡gracias por recordármelo! buscaré la chaqueta.

source: okay, maybe fifth time’s the charm. i can do this!
es_419: bien, tal vez la quinta sea la vencida. ¡puedo lograrlo!

source: and you of all people would know that, right?
es_419: y tú lo sabes mejor que nadie, ¿no?

source: c’mon, can’t you tell? man, think of all the chances you missed!
es_419: vamos, ¿no lo notas? ¡piensa en todas las oportunidades que perdiste!

source: yeah, but you know...
es_419: sí, pero ya sabes…

source: oh! you’re the girl from-
es_419: ¡ah! eres la chica de…

source: um, so, thanks for last night!
es_419: bueno, ¡gracias por lo de anoche!

source: aight, gather round boys.
es_419: señores, reunión del clan.

source: not buying it.
es_419: buena actuación.

source: so, shiro finally showed you his bedroom, huh?
es_419: así que por fin shiro te mostró su cuarto, ¿eh?

source: hey, whatever it is, you probably got the wrong guy.
es_419: oye, quizá te has equivocado de persona.

source: they won’t be bothering you anymore.
es_419: ya no van a molestarte.

source: i don’t even know you, leave me alone!
es_419: ni siquiera te conozco, ¡déjame en paz!

source: same, same! we’ve got a lot to catch up on. what are you two up to tonight?
es_419: ¡igualmente! tenemos que ponernos al día. ¿qué harán esta noche?

source: hmm... it doesn’t look too good though...
es_419: mmm… aunque la cosa no se ve muy bien…

source: even if you were busy, couldn’t you a least send me a text back?
es_419: aunque estuvieras ocupado, ¿no podrías haberme enviado un mensaje?

source: and look, it fits like a glove!
es_419: y mira, ¡me queda como un guante!

source: i just finished my shift and thought i’d say hi before you take off.
es_419: acabo de terminar mi turno y pensé saludarte antes de que te fueras.

source: wake up...
es_419: despierta…

source: y’know, it’s like what you said before, it’s dangerous in the city these days, especially at night.
es_419: bueno, ya vimos que la ciudad se ha vuelto peligrosa últimamente, sobre todo por la noche.

source: yep, checks out.
es_419: sip, confirmado.

source: what kind of boyfriend disappears and just shows up only when it’s convenient?!
es_419: ¡¿qué clase de novio desaparece y solo vuelve a aparecer cuando le viene bien?!

source: fine, say we got all that covered, you’re still... okay with being around someone like me?.
es_419: bien, olvidemos eso. aun así… ¿estás cómoda relacionándote con alguien como yo?

source: n-no, wait!
es_419: ¡n-no, espera!

source: m-may i?
es_419: ¿p-puedo?

source: oh. right.
es_419: así es.

source: um... yeah? i think so.
es_419: mmm, sí. eso creo.

source: yeah, it’s been awhile, you look the same!
es_419: sí, cuánto tiempo, ¡tú estás igual!

source: it’s nothing big, though it was really last minute.
es_419: nada importante, algo que surgió en el último momento.

source: ...there will always be consequences.
es_419: … siempre habrá consecuencias.

source: i think you could pull it off! i’d hire you-
es_419: creo que lo harías bien. yo te contrataría…

source: so you’re his babysitter now? somehow, that suits you.
es_419: conque eres su niñera, ¿eh? encaja contigo.

source: rhea. are you sure you don’t mind if i take off first?
es_419: rhea, ¿seguro que no te molesta que me vaya primero?

source: i heard his family is a group of mobsters...
es_419: dicen que sus familiares son mafiosos…

source: different?
es_419: ¿diferente?

source: wait, n-no, that’s not what i meant.
es_419: aguarda, n-no, no quise decir eso.

source: usually when he doesn’t come back, he’s just chilling at his fam’s, y’know, the Iekami residence?
es_419: cuando no viene, suele ser porque está con su familia. ¿recuerdas la residencia iekami?

source: come with us quietly, we’ll treat you real nice-
es_419: ven calladita. te trataremos bien…

source: rhea... i think you’re thinking too hard about this...
es_419: rhea… creo que no es para tanto…

source: pfft... wow, you really are a tough cookie, aren’t ya?
es_419: uf… eres un hueso duro de roer, ¿eh?

source: i heard he got paid big for that job.
es_419: oí que le pagaron mucho por el trabajo.

source: oh, nothing much!
es_419: ¡ah, nada!

source: i think i have a better idea...
es_419: tengo una idea mejor…

source: give yourself a few more years and all that sugar just gets you a doctor’s appointment!
es_419: ¡unos años más, y toda esa azúcar te llevará al consultorio del médico!

source: hang on, you didn’t touch your coffee. do you want it to-go?
es_419: aguarda, no tomaste el café. ¿lo quieres para llevar?

source: n-no problem....
es_419: d-de nada…

source: uh... we used to go to school together when we were kids.
es_419: eh… íbamos juntos a la escuela cuando éramos niños.

source: so what has shiro told you?
es_419: entonces, ¿qué te dijo shiro?

source: ...i thought i felt something on his shoulder...
es_419: … me pareció sentir algo en su hombro…

source: hey! it’s okay, you’re okay.
es_419: no pasa nada, estás bien.

source: oh, or you could come visit me instead?
es_419: o podrías venir a visitarme, ¿no?

source: i thought it was just some silly rumour.
es_419: pensé que era algo sin sentido.

source: i got the goods. are y’all ready to partaaaay?
es_419: ya tengo todo. ¿listos para la superfiesta?

source: why are you green?!
es_419: ¡¿por qué eres verde?!

source: there was a man who was hurt and he fled the scene. did you guys find him?
es_419: el hombre al que hirieron y huyó del lugar. ¿pudieron encontrarlo?

source: it’s okay... just shake it off.
es_419: no pasa nada, solo olvídalo.

source: nO, don’t come any closer!
es_419: ¡no! ¡no te acerques!

source: it’s fine. i want to.
es_419: no lo es. quiero hacerlo.

source: what, you know him?
es_419: ¿lo conoces?

source: oh, really?
es_419: ah, ¿sí?

source: they... break the law, and that makes them criminals, right?
es_419: porque… incumplen la ley. eso los convierte en delincuentes, ¿no?

source: but it sure as hell feels like it!
es_419: ¡pero créeme que se oyó así!

source: shiro, make him stop!
es_419: shiro, ¡dile que pare!

source: right. how sweet.
es_419: ah, qué ternura.

source: i don’t know how much you know about the outskirts, but my mom said there’s a lot to do there too. it’ll be different!
es_419: no sé mucho sobre vivir en las afueras, pero mi mamá dice que también hay mucho que hacer allí. ¡será diferente!

source: ugh, yeah, tell me about it.
es_419: ay, sí. ni lo digas.

source: c’mon, there’s no way.
es_419: vamos, no puede ser.

source: he’s cute...
es_419: qué lindo…

source: bas? you mean...
es_419: ¿bas? hablas de…

source: that look in your eyes...
es_419: tu mirada…

source: oi, oi, HE did that? god, that makes my blood boil.
es_419: un momento, ¿fue él? cielos, eso me enfurece.

source: just come with me, i’ll show you a good time-
es_419: eh, ven conmigo, la pasarás bien…

source: we made plans with rhea, right? something about a home movie.
es_419: hicimos planes con rhea, ¿no? para ver una película en casa.

source: w-wait, you can’t be serious?!
es_419: ¿q-qué? ¡¿hablas en serio?!

source: look at it, it defies gravity!
es_419: míralo, ¡desafía la gravedad!

source: i know i didn’t turn out to be who you thought i would be, so please be honest, rhea.
es_419: me doy cuenta de que no soy la persona que recordabas, así que sé sincera, rhea.

source: don’t worry son, the men in this family have a history of being successful romantics. plus, you’ve inherited my good looks which is a massive advantage.
es_419: no te preocupes, los hombres de esta familia tenemos antecedentes de ser exitosos en el amor. además, heredaste mis rasgos físicos. es una enorme ventaja.

source: hey, don’t touch her!
es_419: ¡eh, no la toques!

source: okay, that’s great to hear.
es_419: ah, me alegra saberlo.

source: there’s another man here, he’s hurt, you have to help him!
es_419: hay otro hombre. está herido, ¡tienen que ayudarlo!

source: ehhh? does my boy finally have a girlfriend?
es_419: ¿cómo? ¿mi muchacho al fin tiene novia?

source: he’s early for once, what a surprise.
es_419: por una vez es puntual. qué sorpresa.

source: i’m serious! no one aside from the witnesses would know how they look like, but even so, it’s pretty vague.
es_419: ¡en serio! solo los testigos saben qué aspecto tienen, pero, aun así, no hay nada claro.

source: alright, alright, i’ll check again. but until then, just get some rest, okay?
es_419: está bien, volveré a preguntar. hasta entonces, descansa, ¿de acuerdo?

source: oh, is this shared housing?
es_419: ¡ah! ¿es una vivienda compartida?

source: stop following me!
es_419: ¡deja de seguirme!

source: yes, i’m aware of that.
es_419: sí, lo entiendo.

source: yes, i did!
es_419: ¡sí, yo!

source: about the incident last night, you went rogue.
es_419: en el incidente de anoche te saliste de la regla.

source: you could say we provide a service, and everyone in the family are a part of it. i just mostly work the night shift.
es_419: se podría decir que ofrecemos un servicio, y todos en la familia participamos. yo trabajo principalmente en el turno noche.

source: that was the same one from before, wasn’t it?
es_419: es el mismo de antes, ¿no?

source: i do, but we don’t have to go into that now if you don’t want to.
es_419: sí, pero no quiero hacértelas ahora si tú no quieres responderlas.

source: hey, are you okay? where are your parents?
es_419: oye, ¿estás bien? ¿dónde están tus padres?

source: i trust you.
es_419: confío en ti.

source: it’s my first real gift to a friend, so take good care of it, okay?
es_419: es el primer regalo que le hago a un amigo, así que cuídalo, ¿sí?

source: hehe
es_419: JEJE

source: sure it does.
es_419: claro que sí.

source: no, not at all. i like boring.
es_419: en absoluto. me gusta aburrirme.

source: he doesn’t look too happy...
es_419: no se lo ve contento…

source: relax girl, it’s all chill! there’s plenty of room for ya.
es_419: caaalma, chica, ¡está todo bien! hay mucho espacio aquí.

source: and this isn’t your first time. you knew how important it is to me to have you around.
es_419: y no es la primera vez. sabes lo importante que es para mí tenerte cerca.

source: ah... it’s been over twenty minutes. what could they be talking about for so long?
es_419: uf… ya pasaron más de veinte minutos. ¿de qué hablarían todo ese tiempo?

source: yes, and i’m beginning to think you found a new one behind my back!
es_419: ¡lo creo! ¡y estoy empezando a pensar que estás viendo a otra persona!

source: yes, i’m very sure. why would i make that up?
es_419: sí, muy segura. ¿por qué lo inventaría?

source: i’m not ready yet, you didn’t have to come over.
es_419: aún no estoy lista, no tenías que venir.

source: i...no, you can stay. please stay.
es_419: yo… puedes quedarte. no te vayas.

source: i wasn’t ready to lose you too.
es_419: no estaba listo para perderte.

source: so what’s with all the questions anyway? was that a test?
es_419: pero, oye, ¿por qué todas estas preguntas? ¿es una prueba?

source: nah, don’t worry about it, the movie wasn’t that great.
es_419: bah, no te preocupes, ni siquiera estuvo tan buena.

source: guess the weather has got everyone craving for dessert!
es_419: ¡supongo que el buen tiempo hace que todos quieran helado!

source: shiro? is that really you?
es_419: ¿shiro? ¿en serio eres tú?

source: that’s not what i said.
es_419: no dije eso.

source: L-LOVEBIRDS?!
es_419: ¡¿tortolitos?!

source: it’s never my intention to rope you into this, so...
es_419: nunca fue mi intención involucrarte en esto, entonces...

source: but earlier, from before...
es_419: pero recién…

source: no thanks. it’s cold now.
es_419: no, gracias. ya está frío.

source: bas! are you awake?
es_419: ¡bas! ¿estás despierto?

source: three months ago
es_419: tres meses antes

source: hang on, rhea, i know you’re eager to leave
es_419: espera, rhea, sé que estás ansiosa por partir.

source: man, that chick is crazy.
es_419: oye, esa chica está loca.

source: i’m not pulling anything.
es_419: no te estoy haciendo nada.

source: right, it’s getting kind of late. i’ll help you clean up before i get going.
es_419: bueno, se está haciendo tarde. te ayudaré a limpiar antes de irme.

source: wait a minute…
es_419: un momento…

source: c’mon, you’re making this way harder than it needs to be.
es_419: vamos, me lo estás poniendo demasiado difícil.

source: he already told me about you a long time ago.
es_419: él me habló de ti hace mucho tiempo.

source: ugh, not now-
es_419: ay, ahora no…

source: you’re not from around here, you don’t look like you’re from the city.
es_419: no eres de aquí, no pareces ser de la ciudad.

source: hmm... something is up.
es_419: mmm… algo pasa.

source: oh, is that what you think?
es_419: ah, ¿es lo que crees?

source: what do you mean?
es_419: ¿qué quieres decir?

source: you weren’t staying over with a girl?
es_419: ¿no estabas con una chica?

source: everyone born into the family is expected to work here.
es_419: se espera que toda la familia participe en el negocio.

source: relax, i think i know what you mean... well, not really, but it’s fine?
es_419: tranquila, entiendo lo que dices. bueno, en realidad no tanto, pero está bien.

source: is that why you moved to the city?
es_419: ¿por eso te mudaste a la ciudad?

source: yeah, but i didn’t care about it at all, because right after that-
es_419: sí, pero al final estuvo bien, porque justo después de eso…

source: anyway, that’s my cue to leave.
es_419: bien, debo irme.

source: the last time you mentioned her, you didn’t sound too happy.
es_419: la última vez que la mencionaste, no te veías muy feliz.

source: the shiro i knew before wouldn’t have told me any of the things you just did.
es_419: aquel shiro no me habría dicho ninguna de las cosas que me acabas de decir.

source: well... yeah, but...
es_419: bueno, sí, pero…

source: wow...
es_419: ooh…

source: maybe you can stay a little longer, for the summer?
es_419: ¿no podrías quedarte a pasar el verano?

source: if the rumors are true...
es_419: si los rumores son ciertos…

source: OOOOOKAY!
es_419: ¡bueeeno!

source: well, i could check again, but i got home a few hours ago and his shoes weren’t around.
es_419: bueno, voy a mirar de nuevo, pero llegué a casa hace unas horas y sus cosas no estaban.

source: would you be upset if i said no?
es_419: ¿te molestaría si dijera que no?

source: we’ve never had much of a discussion about it, let alone exploring other options.
es_419: nunca se ha cuestionado, y la posibilidad de hacer otra elección es casi nula.

source: FLATS
es_419: colores planos

source: don’t worry, bas. we’re okay.
es_419: no te preocupes, todo está bien.

source: oh god, i can’t believe i got away with that haircut!
es_419: ¡ay, no puedo creer que anduviera con ese corte de pelo!

source: and just when i thought things were gonna be different this time.
es_419: y justo cuando creí que todo empezaría a ser diferente.

source: oh, so are you going somewhere again?
es_419: ah, ¿y saldrás de nuevo?

source: god, i don’t know what else to tell you, but you sound like you’ve got issues that have nothing to do with me.
es_419: cielos, no sé qué más decirte, pero tus problemas no tienen nada que ver conmigo.

source: sometimes people see things when they are in shock, and you were hit on the head-
es_419: cuando las personas están en shock, a veces ven cosas. a ti te golpearon en la cabeza…

source: it is your recklessness that made us lose our insurance, have you learned nothing over the years?!
es_419: fue tu imprudencia la que nos hizo perder nuestro seguro, ¡¿no has aprendido nada en todos estos años?!

source: thanks, though.
es_419: gracias, amigo.

source: did you guys find anyone else at the scene?
es_419: ¿encontraron a alguien más en el lugar?

source: i... don’t know what to say, it’s a lot to take in, but after that big scare this morning, i’m just relieved you’re okay.
es_419: yo... no sé qué decir, es mucho lo que debo asimilar, pero después del gran susto de anoche, me alivia que aún estés aquí.

source: hmm.
es_419: mmm.

source: i know there are many injustices in the world, but it is simply not our job to risk our safety for people we are not hired to protect.
es_419: sé que el mundo está lleno de injusticias, pero no podemos arriesgar nuestra seguridad por personas que no nos contratan para proteger.

source: i’m waiting for someone, so do you mind?
es_419: si no te molesta, espero a alguien.

source: i call dibs on the little one!
es_419: ¡la pequeña es para mí!

source: the guy i knew before wouldn’t have told me any of the things you just did.
es_419: aquel shiro no me habría dicho ninguna de las cosas que me acabas de decir.

source: i understand.
es_419: lo entiendo.

source: damn, my bad. are you okay?
es_419: uy, lo siento. ¿estás bien?

source: i was so busy with becky that i didn’t stop to think about you-
es_419: estaba tan ocupado con becky que me olvidé de pensar en ti…

source: last time we spoke, it didn’t sound like you were ever coming back.
es_419: la última vez que hablamos, tuve la impresión de que no volverías.

source: seriously, it’s fine.
es_419: en serio, va todo bien.

source: it’s a lot to take in, but after that big scare this morning, i’m just relieved you’re still here.
es_419: es mucho lo que debo asimilar, pero después del gran susto de anoche, me alivia que aún estés aquí.

source: by coincidence. i mean...
es_419: como una coincidencia. digo…

source: but that’s such a hassle!
es_419: ¡pero es una molestia!

source: but he shows up with a new bruise every time...
es_419: pero anda siempre lleno de moretones…

source: noooo not at all! i’m just saying it’s a possibility, it’s a compliment!
es_419: ¡nooo, para nada! lo menciono como posibilidad, ¡es un cumplido!

source: it’s nice to do nothing sometimes.
es_419: a veces es agradable no hacer nada.

source: it depends. what kind of friends?
es_419: depende. ¿qué clase de amigos?

source: all this time when you were out late at night, and when you don’t come home, when you disappear for days without a warning…
es_419: en todo este tiempo, cuando salías tarde en la noche y no regresabas a casa, cuando desaparecías durante días y no avisabas…

source: damn, rhea... were you always into that kinda stuff...?
es_419: caray, rhea… ¿siempre te interesaron esas cosas?…

source: hey, it’s okay, we’ll get you home as soon as we can, i promise.
es_419: tranquila, te llevaremos pronto, lo prometo.

source: i still haven’t got a proper job and have had no luck meeting anyone new.
es_419: aún no consigo un trabajo decente y no he tenido suerte para conocer a alguien.

source: the old man is not always right, you know.
es_419: los viejos no siempre tienen razón.
